ACU-IOTrotarygarage/ESP32-Firmware/lib/default/headers/esp-knx-ip.h
  private:
    void __start();

    void __loop_knx();

    // Webserver functions
    void __loop_webserver();
    void __handle_root();
    void __handle_register();
    void __handle_delete();
    void __handle_set();
#if !DISABLE_EEPROM_BUTTONS
    void __handle_eeprom();
#endif
    void __handle_config();
    void __handle_feedback();
#if !DISABLE_RESTORE_BUTTONS
    void __handle_restore();
#endif
#if !DISABLE_REBOOT_BUTTONS
    void __handle_reboot();
#endif

    void __config_set_flags(config_id_t id, config_flags_t flags);

    void __config_set_string(config_id_t id, String &val);
    void __config_set_int(config_id_t id, int32_t val);
    void __config_set_bool(config_id_t id, bool val);
    void __config_set_options(config_id_t id, uint8_t val);
    void __config_set_ga(config_id_t id, address_t const &val);

    bool __callback_is_id_valid(callback_id_t id);

    callback_assignment_id_t __callback_register_assignment(address_t address, callback_id_t id);
    void __callback_delete_assignment(callback_assignment_id_t id);

    //static inline float pow(float a, float b) { return FastPrecisePowf(a, b); }

    ESP8266WebServer *server;
    address_t physaddr;

    WiFiUDP udp;

    callback_assignment_id_t registered_callback_assignments;
    callback_assignment_id_t free_callback_assignment_slots;
    callback_assignment_t callback_assignments[MAX_CALLBACK_ASSIGNMENTS];

    callback_id_t registered_callbacks;
    callback_id_t free_callback_slots;
    callback_t callbacks[MAX_CALLBACKS];

    config_id_t registered_configs;
    uint8_t custom_config_data[MAX_CONFIG_SPACE];
    uint8_t custom_config_default_data[MAX_CONFIG_SPACE];
    config_t custom_configs[MAX_CONFIGS];

    feedback_id_t registered_feedbacks;
    feedback_t feedbacks[MAX_FEEDBACKS];

    uint16_t __ntohs(uint16_t);
};

// Global "singleton" object
extern ESPKNXIP knx;

#endif
